Autodesk.Revit.DB.InsulationLiningBase.GetLiningIds(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns the ids of the lining elements associated to a given element.
document:
The document.
elemId:
The element.
Returns:
A collection of the ids of the lining elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This id does not represent a duct, fitting, or accessory element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.InsulationLiningBase.GetInsulationIds(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns the ids of the insulation elements associated to a given element.
document:
The document.
elemId:
The element.
Returns:
A collection of the ids of the insulation elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This id does not represent a valid host for insulation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012